---
kind: type
id: T:Autodesk.Revit.Exceptions.RegenerationFailedException
source: html/787bb389-74c2-5ce7-cdd6-32211209ded2.htm
---
# Autodesk.Revit.Exceptions.RegenerationFailedException

The exception that is thrown when a regeneration operation failed.

## Syntax (C#)
```csharp
[SerializableAttribute]
public class RegenerationFailedException : InvalidOperationException
```